jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/*
 * Copyright (C) 2016 Ingenic Semiconductor
 * SunWenZhong(Fighter) <wenzhong.sun@ingenic.com, wanmyqawdr@126.com>
 *
 * Copyright (C) 1994, 1995, 1996, 1997, 2000, 2001 by Ralf Baechle
 * Copyright (C) 2000 Silicon Graphics, Inc.
 * Modified for further R[236]000 support by Paul M. Antoine, 1996.
 * Kevin D. Kissell, kevink@mips.com and Carsten Langgaard, carstenl@mips.com
 * Copyright (C) 2000, 07 MIPS Technologies, Inc.
 * Copyright (C) 2003, 2004  Maciej W. Rozycki
 *
 * For project-5
 *
 * Release under GPLv2
 *
 */


#ifndef FLOADER_M200_H
#define FLOADER_M200_H

#ifndef __ASSEMBLY__


/*
 * Sleep lib
 */
#define SLEEP_LIB_TCSM          0xb3426000
#define SLEEP_LIB_LPDDR2        0x8fff8000
#define SLEEP_LIB_SIZE          (16 * 1024)
#define SLEEP_LIB_EMMC_ADDRESS  (43 * 1024)

enum pmu_t {
    SM5007 = 0,
    RICOH_5T619
};

struct m200_sleep_lib_entry
{
    void (*enable_set_pmu_suspend_mode_voltage)(
            int enable, unsigned int core_volt_mV, unsigned int ddr_vdd2_volt_mV);
    void (*enable_sleep_poweroff_mode)(int enable);
    void (*restore_context)(void);
    int (*enter_sleep)(int state);
    void (*select_pmu)(enum pmu_t pmu);
};


/*
 * PUBL DLL bypass configuration
 */
#define CONFIG_DDR_PUBL_DLL_BYPASS_FREQ    300000000

/*
 * Types alias
 */
typedef __signed char s8;
typedef unsigned char u8;

typedef __signed short s16;
typedef unsigned short u16;

typedef __signed int s32;
typedef unsigned int u32;

typedef unsigned long ulong;

typedef __signed long long s64;
typedef unsigned long long u64;


typedef unsigned long int uintptr_t;
typedef u8 uint8_t;
typedef u16 uint16_t;
typedef u32 uint32_t;
typedef u64 uint64_t;

typedef u8 uchar;
typedef u16 ushort;
typedef u32 uint;

typedef u32 size_t;

typedef ulong lbaint_t;

#define ARCH_DMA_MINALIGN   32

#define ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0]))

#define ROUND(a,b)              (((a) + (b) - 1) & ~((b) - 1))
#define DIV_ROUND(n,d)          (((n) + ((d)/2)) / (d))
#define DIV_ROUND_UP(n,d)       (((n) + (d) - 1) / (d))
#define roundup(x, y)           ((((x) + ((y) - 1)) / (y)) * (y))

#define ALIGN(x,a)              __ALIGN_MASK((x),(typeof(x))(a)-1)
#define __ALIGN_MASK(x,mask)    (((x)+(mask))&~(mask))


#define PAD_COUNT(s, pad) ((s - 1) / pad + 1)
#define PAD_SIZE(s, pad) (PAD_COUNT(s, pad) * pad)
#define ALLOC_ALIGN_BUFFER_PAD(type, name, size, align, pad)        \
    char __##name[ROUND(PAD_SIZE(size * sizeof(type), pad), align)  \
              + (align - 1)];                   \
                                    \
    type *name = (type *) ALIGN((uintptr_t)__##name, align)
#define ALLOC_ALIGN_BUFFER(type, name, size, align)     \
    ALLOC_ALIGN_BUFFER_PAD(type, name, size, align, 1)
#define ALLOC_CACHE_ALIGN_BUFFER_PAD(type, name, size, pad)     \
    ALLOC_ALIGN_BUFFER_PAD(type, name, size, ARCH_DMA_MINALIGN, pad)
#define ALLOC_CACHE_ALIGN_BUFFER(type, name, size)          \
    ALLOC_ALIGN_BUFFER(type, name, size, ARCH_DMA_MINALIGN)

/*
 * DEFINE_CACHE_ALIGN_BUFFER() is similar to ALLOC_CACHE_ALIGN_BUFFER, but it's
 * purpose is to allow allocating aligned buffers outside of function scope.
 * Usage of this macro shall be avoided or used with extreme care!
 */
#define DEFINE_ALIGN_BUFFER(type, name, size, align)            \
    static char __##name[roundup(size * sizeof(type), align)]   \
            __aligned(align);               \
                                    \
    static type *name = (type *)__##name
#define DEFINE_CACHE_ALIGN_BUFFER(type, name, size)         \
    DEFINE_ALIGN_BUFFER(type, name, size, ARCH_DMA_MINALIGN)

/*
 * Stop errors
 */
#define STOP_ERROR_DETECT_PMU_FAILED                1
#define STOP_ERROR_DELAY_UNAVAILABLE                2
#define STOP_ERROR_WRONG_GPIO_NUM                   3
#define STOP_ERROR_PUBL_PGSR_TIMEOUT                4
#define STOP_ERROR_PUBL_PGSR_TRAINING_FAILED        5
#define STOP_ERROR_DRAM_WRONG_STATE                 6
#define STOP_ERROR_PMU_WRITE_FAILED                 7
#define STOP_ERROR_PMU_WRONG_VALUE                  8
#define STOP_ERROR_EMMC_MSC0_INIT_FAILED            9
#define STOP_ERROR_EMMC_MSC0_LOADER_FAILED          10


#define NULL ((void *) 0)
/*
 * Define the bit field macro to avoid the bit mistake
 */
#define BIT0            (1 << 0)
#define BIT1            (1 << 1)
#define BIT2            (1 << 2)
#define BIT3            (1 << 3)
#define BIT4            (1 << 4)
#define BIT5            (1 << 5)
#define BIT6            (1 << 6)
#define BIT7            (1 << 7)
#define BIT8            (1 << 8)
#define BIT9            (1 << 9)
#define BIT10           (1 << 10)
#define BIT11           (1 << 11)
#define BIT12           (1 << 12)
#define BIT13           (1 << 13)
#define BIT14           (1 << 14)
#define BIT15           (1 << 15)
#define BIT16           (1 << 16)
#define BIT17           (1 << 17)
#define BIT18           (1 << 18)
#define BIT19           (1 << 19)
#define BIT20           (1 << 20)
#define BIT21           (1 << 21)
#define BIT22           (1 << 22)
#define BIT23           (1 << 23)
#define BIT24           (1 << 24)
#define BIT25           (1 << 25)
#define BIT26           (1 << 26)
#define BIT27           (1 << 27)
#define BIT28           (1 << 28)
#define BIT29           (1 << 29)
#define BIT30           (1 << 30)
#define BIT31           (1 << 31)

/*
 * GPIO helpers
 */
#define GPIO_PA(n)  (0*32 + n)
#define GPIO_PB(n)  (1*32 + n)
#define GPIO_PC(n)  (2*32 + n)
#define GPIO_PD(n)  (3*32 + n)
#define GPIO_PE(n)  (4*32 + n)
#define GPIO_PF(n)  (5*32 + n)
#define GPIO_PG(n)  (6*32 + n)

enum gpio_function {
    GPIO_FUNC_0,
    GPIO_FUNC_1,
    GPIO_FUNC_2,
    GPIO_FUNC_3,
};

/*
 * IO helpers
 */
#define readb(addr) (*(volatile unsigned char *)(addr))
#define readw(addr) ((*(volatile unsigned short *)(addr)))
#define readl(addr) ((*(volatile unsigned int *)(addr)))

#define writeb(b, addr) ((*(volatile unsigned char *)(addr)) = (b))
#define writew(b, addr) ((*(volatile unsigned short *)(addr)) = (unsigned short)(b))
#define writel(b, addr) ((*(volatile unsigned int *)(addr)) = (unsigned int)(b))


