jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/*
 * Unaligned access helpers
 */
static inline u16 __get_unaligned_le16(const u8 *p)
{
    return p[0] | p[1] << 8;
}

static inline u32 __get_unaligned_le32(const u8 *p)
{
    return p[0] | p[1] << 8 | p[2] << 16 | p[3] << 24;
}

static inline u64 __get_unaligned_le64(const u8 *p)
{
    return (u64)__get_unaligned_le32(p + 4) << 32 |
           __get_unaligned_le32(p);
}

static inline void __put_unaligned_le16(u16 val, u8 *p)
{
    *p++ = val;
    *p++ = val >> 8;
}

static inline void __put_unaligned_le32(u32 val, u8 *p)
{
    __put_unaligned_le16(val >> 16, p + 2);
    __put_unaligned_le16(val, p);
}

static inline void __put_unaligned_le64(u64 val, u8 *p)
{
    __put_unaligned_le32(val >> 32, p + 4);
    __put_unaligned_le32(val, p);
}

static inline u16 get_unaligned_le16(const void *p)
{
    return __get_unaligned_le16((const u8 *)p);
}

static inline u32 get_unaligned_le32(const void *p)
{
    return __get_unaligned_le32((const u8 *)p);
}

static inline u64 get_unaligned_le64(const void *p)
{
    return __get_unaligned_le64((const u8 *)p);
}

static inline void put_unaligned_le16(u16 val, void *p)
{
    __put_unaligned_le16(val, p);
}

static inline void put_unaligned_le32(u32 val, void *p)
{
    __put_unaligned_le32(val, p);
}

static inline void put_unaligned_le64(u64 val, void *p)
{
    __put_unaligned_le64(val, p);
}

struct i2c {
    unsigned int scl;
    unsigned int sda;
    char* name;
};

int i2c_write(struct i2c *i2c,unsigned char chip,
        unsigned int addr, int alen, unsigned char *buffer, int len);
int i2c_read(struct i2c *i2c,unsigned char chip,
        unsigned int addr, int alen, int repeat_start,
        unsigned char *buffer, int len);

int i2c_probe(struct i2c *i2c, unsigned char addr);

void init_mmc_host();
ulong mmc_bread(lbaint_t start, lbaint_t blkcnt, void *dst);

void pmu_sm5007_set_core_voltage(int mV);
void pmu_sm5007_set_core_sleep_voltage(int mV);
int probe_sm5007();

void pmu_5t619_set_core_voltage(int mV);
void pmu_5t619_set_core_sleep_voltage(int mV);
void pmu_5t619_set_ddr_vdd2_voltage(int mV);
void pmu_5t619_set_ddr_vdd2_sleep_voltage(int mV);
void pmu_5t619_set_buck5_for_vibrate(int mV);
int probe_5t619();

int is_boot_from_powerup();

void init_uart();
void init_clk();
void reset_clk_tree();

unsigned int get_ddr_freq();
void set_msc0_freq(unsigned int freq);
unsigned int get_msc0_freq();

void boot_from_ddr();
void boot_from_emmc();
void init_sleep_lib(enum pmu_t pmu);
void enter_sleep_with_powerkey_wake();

void init_lpddr2(int is_from_powerup);
void lpddr2_enter_self_refresh();
void lpddr2_exit_self_refresh(
                        unsigned int training_pir,
                        unsigned int done_mask,
                        unsigned int training_timeout);
void prepare_lpddr2_for_sleep();
void restore_lpddr2();

void enable_clock_uart3();

#ifdef DEBUG
    #define debug(formats, args...) printf(formats, ##args)
#else
    #define debug(formats, args...)
#endif

void putc(const char c);
void puts(const char *s);
int printf(const char *fmt, ...);
int sprintf(char *buf, const char *fmt, ...);

void udelay(unsigned long usec);
void mdelay(unsigned long msec);

char *strcpy(char *dest,const char *src);

void *memcpy(void *dest, const void *src, size_t count);
void *memset(void *s,int c, size_t count);
int memcmp(const void *cs,const void *ct,size_t count);

void dump_mem_u8(const void *src, unsigned int size_by_byte);
void dump_mem_u32(const void *src, unsigned int size_by_byte);

void flush_icache_all(void);
void flush_dcache_all(void);
void flush_cache_all(void);
void init_cache(void);
void flush_scache_all(void);

void local_flush_tlb_all(void);

int gpio_request(int gpio, const char *label);
int gpio_free(int gpio);
int gpio_set_value(int gpio, int value);
int gpio_get_value(int gpio);
int gpio_direction_input(int gpio);
int gpio_direction_output(int gpio, int value);
int gpio_enable_pullup(int gpio);
int gpio_disable_pullup(int gpio);
int gpio_set_func(int gpio, enum gpio_function func);
void gpio_enable_pa30_as_fall_edge_irq();
void gpio_disable_ack_pa30_irq();

void stop(int stop_reason);

void select_pmu(enum pmu_t pmu);
enum pmu_t get_pmu();
/*
 * Define the module base addresses
 */

/* AHB0 BUS Devices Base */
#define HARB0_BASE      0xb3000000
#define DDRC_BASE       0xb34f0000
#define DDRC_APB_BASE   0xb3012000
#define DDR_PHY_OFFSET  (-0x4e0000 + 0x1000)
#define X2D_BASE    0xb3030000
#define GPU_BASE    0xb3040000
#define LCDC0_BASE  0xb3050000
#define CIM_BASE    0xb3060000
#define COMPRESS_BASE   0xb3070000
#define IPU0_BASE   0xb3080000
#define GPVLC_BASE  0xb3090000
/*#define LCDC1_BASE    0xb30a0000*/
#define IPU1_BASE   0xb30b0000
#define MONITOR_BASE    0xb30f0000

/* AHB1 BUS Devices Base */
#define SCH_BASE    0xb3200000
#define VDMA_BASE   0xb3210000
#define EFE_BASE    0xb3240000
#define MCE_BASE    0xb3250000
#define DBLK_BASE   0xb3270000
#define VMAU_BASE   0xb3280000
#define SDE_BASE    0xb3290000
#define AUX_BASE    0xb32a0000
#define TCSM_BASE   0xb32c0000
#define JPGC_BASE   0xb32e0000
#define SRAM_BASE   0xb32f0000

/* AHB2 BUS Devices Base */
#define HARB2_BASE  0xb3400000
#define NFI_BASE    0xB3410000
#define NEMC_BASE   0xb3410000
#define PDMA_BASE   0xb3420000
#define MSC0_BASE   0xb3450000
#define MSC1_BASE   0xb3460000
#define MSC2_BASE   0xb3470000
#define GPS_BASE    0xb3480000
#define EHCI_BASE   0xb3490000
#define OHCI_BASE   0xb34a0000
#define ETHC_BASE   0xb34b0000
#define BCH_BASE    0xb34d0000
#define TSSI0_BASE  0xb34e0000
#define TSSI1_BASE  0xb34f0000
#define OTG_BASE    0xb3500000
#define EFUSE_BASE  0xb3540000

#define OST_BASE    0xb2000000
#define HDMI_BASE   0xb0180000

/* APB BUS Devices Base */
#define CPM_BASE    0xb0000000
#define INTC_BASE   0xb0001000
#define TCU_BASE    0xb0002000
#define RTC_BASE    0xb0003000
#define GPIO_BASE   0xb0010000
#define AIC0_BASE   0xb0020000
#define AIC1_BASE   0xb0021000
#define UART0_BASE  0xb0030000
#define UART1_BASE  0xb0031000
#define UART2_BASE  0xb0032000
#define UART3_BASE  0xb0033000
#define UART4_BASE  0xb0034000
#define SSC_BASE    0xb0040000
#define SSI0_BASE   0xb0043000
#define SSI1_BASE   0xb0044000
#define I2C0_BASE   0xb0050000
#define I2C1_BASE   0xb0051000
#define I2C2_BASE   0xb0052000
#define I2C4_BASE   0xb0054000
#define KMC_BASE    0xb0060000
#define DES_BASE    0xb0061000
#define SADC_BASE   0xb0070000
#define PCM0_BASE   0xb0071000
#define OWI_BASE    0xb0072000
#define PCM1_BASE   0xb0074000
#define WDT_BASE    0xb0002000

/* NAND CHIP Base Address*/
#define NEMC_CS1_BASE 0xbb000000
#define NEMC_CS2_BASE 0xba000000
#define NEMC_CS3_BASE 0xb9000000
#define NEMC_CS4_BASE 0xb8000000
#define NEMC_CS5_BASE 0xb7000000
#define NEMC_CS6_BASE 0xb6000000

#define AUX_BASE    0xb32a0000

