jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
    unsigned int core_ctrl;         /* $12, sel 2 */
    unsigned int core_reim;         /* $12, sel 4 */
    unsigned int cp0_ecc;
    unsigned int core_reim_low;     /* $12, sel 7 */

    unsigned int cpm_lcr;
    unsigned int cpm_pgr;
    unsigned int cpm_opcr;
    unsigned int cpm_spcr0;
    unsigned int cpm_clkgr;
    unsigned int cpm_clkgr1;
    unsigned int cpm_usbpcr;
};

typedef union ddrc_timing1 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tWL:6;
        unsigned reserved6_7:2;
        unsigned tWR:6;
        unsigned reserved14_15:2;
        unsigned tWTR:6;
        unsigned reserved22_23:2;
        unsigned tRTP:6;
        unsigned reserved30_31:2;
    } b;
} ddrc_timing1_t;

typedef union ddrc_timing2 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tRL:6;
        unsigned reserved6_7:2;
        unsigned tRCD:6;
        unsigned reserved14_15:2;
        unsigned tRAS:6;
        unsigned reserved22_23:2;
        unsigned tCCD:6;
        unsigned reserved30_31:2;
    } b;

} ddrc_timing2_t;

typedef union ddrc_timing3 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tRC:6;
        unsigned reserved6_7:2;
        unsigned tRRD:6;
        unsigned reserved14_15:2;
        unsigned tRP:6;
        unsigned reserved22_23:2;
        unsigned tCKSRE:3;
        unsigned ONUM:4;
        unsigned reserved31:1;
    } b;
} ddrc_timing3_t;

typedef union ddrc_timing4 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tMRD:2;
        unsigned reserved2_3:2;
        unsigned tXP:3;
        unsigned reserved7:1;
        unsigned tMINSR:4;
        unsigned reserved12_15:4;
        unsigned tCKE:3;
        unsigned tRWCOV:2;
        unsigned tEXTRW:3;
        unsigned tRFC:6;
        unsigned reserved30_31:2;
    } b;
} ddrc_timing4_t;

typedef union ddrc_timing5 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tWDLAT:6;
        unsigned reserved6_7:2;
        unsigned tRDLAT:6;
        unsigned reserved14_15:2;
        unsigned tRTW:6;
        unsigned reserved22_23:2;
        unsigned tCTLUPD:8;
    } b;
} ddrc_timing5_t;

typedef union ddrc_timing6 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tCFGR:6;
        unsigned reserved6_7:2;
        unsigned tCFGW:6;
        unsigned reserved14_15:2;
        unsigned tFAW:6;
        unsigned reserved22_23:2;
        unsigned tXSRD:8;
    } b;
} ddrc_timing6_t;

typedef union ddrc_cfg {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned DW:1;
        unsigned BA0:1;
        unsigned CL:4;
        unsigned CS0EN:1;
        unsigned CS1EN:1;
        unsigned COL0:3;
        unsigned ROW0:3;
        unsigned reserved14:1;
        unsigned MISPE:1;
        unsigned ODTEN:1;
        unsigned TYPE:3;
        unsigned reserved20:1;
        unsigned BSL:1;
        unsigned IMBA:1;
        unsigned BA1:1;
        unsigned COL1:3;
        unsigned ROW1:3;
        unsigned reserved30_31:2;
    } b;
} ddrc_cfg_t;

struct ddrc_reg {
    ddrc_cfg_t cfg;
    unsigned int ctrl;
    unsigned int refcnt;
    unsigned int mmap[2];
    unsigned int remap[5];
    ddrc_timing1_t timing1;
    ddrc_timing2_t timing2;
    ddrc_timing3_t timing3;
    ddrc_timing4_t timing4;
    ddrc_timing5_t timing5;
    ddrc_timing6_t timing6;
};

typedef union ddrp_mr0 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned BL:2;
        unsigned CL_2:1;
        unsigned BT:1;
        unsigned CL_4_6:3;
        unsigned TM:1;
        unsigned DR:1;
        unsigned WR:3;
        unsigned PD:1;
        unsigned RSVD:3;
        unsigned reserved16_31:16;
    } ddr3; /* MR0 */
    struct {
        unsigned BL:3;
        unsigned BT:1;
        unsigned CL:3;
        unsigned TM:1;
        unsigned RSVD8_11:4;
        unsigned RSVD12_15:4;
        unsigned reserved16_31:16;
    } lpddr; /* MR */
    struct {
        unsigned unsupported:31;
    } ddr2; /* MR */
    struct {
        unsigned unsupported:31;
    } ddr; /* MR */
} ddrp_mr0_t;

typedef union ddrp_mr1 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned DE:1;
        unsigned DIC1:1;
        unsigned RTT2:1;
        unsigned AL:2;
        unsigned DIC5:1;
        unsigned RTT6:1;
        unsigned LEVEL:1;
        unsigned RSVD8:1;
        unsigned RTT9:1;
        unsigned RSVD10:1;
        unsigned TDQS:1;
        unsigned QOFF:1;
        unsigned RSVD13_15:3;
        unsigned reserved16_31:16;
    } ddr3; /* MR1 */
    struct {
        unsigned BL:3;
        unsigned BT:1;
        unsigned WC:1;
        unsigned nWR:3;
        unsigned reserved8_31:24;
    } lpddr2; /* MR1 */
    struct {
        unsigned unsupported:31;
    } ddr2; /* EMR */
    struct {
        unsigned unsupported:31;
    } ddr; /* EMR */
} ddrp_mr1_t;

typedef union ddrp_mr2 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned PASR:3;
        unsigned CWL:3;
        unsigned ASR:1;
        unsigned SRT:1;
        unsigned RSVD8:1;
        unsigned RTTWR:2;
        unsigned RSVD11_15:5;
        unsigned reserved16_31:16;
    } ddr3; /* MR2 */
    struct {
        unsigned PASR:3;
        unsigned TCSR:2;
        unsigned DS:3;
        unsigned RSVD8_15:8;
        unsigned reserved16_31:16;
    } lpddr; /* EMR */
    struct {
        unsigned RL_WL:4;
        unsigned RSVD4_7:4;
        unsigned reserved8_31:24;
    } lpddr2; /* MR2 */
    struct {
        unsigned unsupported:31;
    } ddr2; /* EMR2 */
} ddrp_mr2_t;

typedef union ddrp_mr3 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned MPRLOC:2;
        unsigned MPR:1;
        unsigned RSVD3_15:13;
        unsigned reserved16_31:16;
    } ddr3; /* MR3 */
    struct {
        unsigned DS:4;
        unsigned RSVD4_7:4;
        unsigned reserved8_31:24;
    } lpddr2; /* MR2 */
    struct {
        unsigned unsupported:31;
    } ddr2; /* EMR3 */
} ddrp_mr3_t;

typedef union ddrp_ptr0 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tDLLSRST:6;
        unsigned tDLLLOCK:12;
        unsigned tITMSRST:4;
        unsigned reserved22_31:10;
    } b;
} ddrp_ptr0_t;

