jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
typedef union ddrp_ptr1 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tDINIT0:19;
        unsigned tDINIT1:8;
        unsigned reserved27_31:5;
    } b;
} ddrp_ptr1_t;

typedef union ddrp_ptr2 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tDINIT2:17;
        unsigned tDINIT3:10;
        unsigned reserved27_31:5;
    } b;
} ddrp_ptr2_t;

typedef union ddrp_dtpr0 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tMRD:2;
        unsigned tRTP:3;
        unsigned tWTR:3;
        unsigned tRP:4;
        unsigned tRCD:4;
        unsigned tRAS:5;
        unsigned tRRD:4;
        unsigned tRC:6;
        unsigned tCCD:1;
    } b;
} ddrp_dtpr0_t;

typedef union ddrp_dtpr1 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tAOND_tAOFD:2;
        unsigned tRTW:1;
        unsigned tFAW:6;
        unsigned tMOD:2;
        unsigned tRTODT:1;
        unsigned reserved12_15:4;
        unsigned tRFC:8;
        unsigned tDQSCK:3;
        unsigned tDQSCKmax:3;
        unsigned reserved30_31:2;
    } b;
} ddrp_dtpr1_t;

typedef union ddrp_dtpr2 {
    /** raw register data */
    unsigned int d32;
    /** register bits */
    struct {
        unsigned tXS:10;
        unsigned tXP:5;
        unsigned tCKE:4;
        unsigned tDLLK:10;
        unsigned reserved29_31:3;
    } b;
} ddrp_dtpr2_t;

struct ddrp_reg {
    unsigned int dcr;
    ddrp_mr0_t mr0;
    ddrp_mr1_t mr1;
    ddrp_mr2_t mr2;
    ddrp_mr3_t mr3;
    unsigned int odtcr;
    unsigned int pgcr;
    ddrp_ptr0_t ptr0;
    ddrp_ptr1_t ptr1;
    ddrp_ptr2_t ptr2;
    ddrp_dtpr0_t dtpr0;
    ddrp_dtpr1_t dtpr1;
    ddrp_dtpr2_t dtpr2;
};

enum {
    DDR3,
    LPDDR,
    LPDDR2,
    DDR2,
    VARIABLE,
};

struct tck {
    unsigned int ps;
    unsigned int ns;
};

struct RL_LPDDR2 {
    unsigned int memclk;
    unsigned int RL;
};

struct WL_LPDDR2 {
    unsigned int memclk;
    unsigned int WL;
};

struct size {
    unsigned int chip0;
    unsigned int chip1;
};

struct lpddr2_params {
    unsigned int tRAS;
    unsigned int tRP;
    unsigned int tRCD;
    unsigned int tRC;
    unsigned int tWR;
    unsigned int tRRD;
    unsigned int tRTP;
    unsigned int tWTR;
    unsigned int tRFC;
    unsigned int tMINSR;
    unsigned int tXP;
    unsigned int tMRD;
    unsigned int tCCD;
    unsigned int tFAW;
    unsigned int tCKE;
    unsigned int tRL;
    unsigned int tWL;
    unsigned int tRDLAT;
    unsigned int tWDLAT;
    unsigned int tRTW;
    unsigned int tCKSRE;
    unsigned int tDLLLOCK;
    unsigned int tXSDLL;
    unsigned int tMOD;
    unsigned int tXPDLL;
    unsigned int tXS;
    unsigned int tXSRD;
    unsigned int tREFI;
    unsigned int tDLLSRST;
    unsigned int tDQSCK;
    unsigned int tDQSCKmax;
};

struct ddr_params {
    unsigned int type;
    unsigned int freq;
    unsigned int div;
    unsigned int cs0;
    unsigned int cs1;
    unsigned int dw32;
    unsigned int cl;
    unsigned int bl;
    unsigned int col;
    unsigned int row;
    unsigned int col1;
    unsigned int row1;
    unsigned int bank8;
    struct tck tck;
    struct size size;
    struct lpddr2_params lpddr2_params;
};

struct global_info {
    uint32_t extal;
    uint32_t cpufreq;
    uint32_t ddrfreq;
    uint32_t ddr_div;
    uint32_t uart_idx;
    uint32_t baud_rate;
    struct ddr_params ddr_params;
};

#define DDR_MEM_PHY_BASE        0x20000000

#define DDRC_STATUS         0x0
#define DDRC_CFG            0x4
#define DDRC_CTRL           0x8
#define DDRC_LMR            0xc
#define DDRC_REFCNT         0x18
#define DDRC_MMAP0          0x24
#define DDRC_MMAP1          0x28
#define DDRC_DLP            0xbc
#define DDRC_STRB           0x34
#define DDRC_AUTOSR_CNT     0x308
#define DDRC_AUTOSR_EN      0x304


/*
 * DDRC APB register offset
 */
#define DDRC_APB_CLKSTP_CFG 0x68
#define DDRC_APB_CKC_CFG0   0x84
#define DDRC_APB_CKC_CFG1   0x88

#define DDRC_TIMING(n)          (0x60 + 4 * (n - 1))
#define DDRC_REMAP(n)           (0x9c + 4 * (n - 1))

#define DDRP_PIR    (DDR_PHY_OFFSET + 0x4) /* PHY Initialization Register */
#define DDRP_PGCR   (DDR_PHY_OFFSET + 0x8) /* PHY General Configuration Register*/
#define DDRP_PGSR   (DDR_PHY_OFFSET + 0xc) /* PHY General Status Register*/
#define DDRP_DLLGCR (DDR_PHY_OFFSET + 0x10) /* DLL General Control Register*/
#define DDRP_ACDLLCR    (DDR_PHY_OFFSET + 0x14) /* AC DLL Control Register*/

#define DDRP_PTR0   (DDR_PHY_OFFSET + 0x18) /* PHY Timing Register 0 */
#define DDRP_PTR1   (DDR_PHY_OFFSET + 0x1c) /* PHY Timing Register 1 */
#define DDRP_PTR2   (DDR_PHY_OFFSET + 0x20) /* PHY Timing Register 2 */

#define DDRP_ACIOCR (DDR_PHY_OFFSET + 0x24) /* AC I/O Configuration Register */
#define DDRP_DXCCR  (DDR_PHY_OFFSET + 0x28) /* DATX8 Common Configuration Register */
#define DDRP_DSGCR  (DDR_PHY_OFFSET + 0x2c) /* DDR System General Configuration Register */
#define DDRP_DCR    (DDR_PHY_OFFSET + 0x30) /* DRAM Configuration Register*/

#define DDRP_DTPR0  (DDR_PHY_OFFSET + 0x34) /* DRAM Timing Parameters Register 0 */
#define DDRP_DTPR1  (DDR_PHY_OFFSET + 0x38) /* DRAM Timing Parameters Register 1 */
#define DDRP_DTPR2  (DDR_PHY_OFFSET + 0x3c) /* DRAM Timing Parameters Register 2 */
#define DDRP_MR0    (DDR_PHY_OFFSET + 0x40) /* Mode Register 0 */
#define DDRP_MR1    (DDR_PHY_OFFSET + 0x44) /* Mode Register 1 */
#define DDRP_MR2    (DDR_PHY_OFFSET + 0x48) /* Mode Register 2 */
#define DDRP_MR3    (DDR_PHY_OFFSET + 0x4c) /* Mode Register 3 */

#define DDRP_ODTCR  (DDR_PHY_OFFSET + 0x50) /* ODT Configure Register */
#define DDRP_DTAR   (DDR_PHY_OFFSET + 0x54) /* Data Training Address Register */
#define DDRP_DTDR0  (DDR_PHY_OFFSET + 0x58) /* Data Training Data Register 0 */
#define DDRP_DTDR1  (DDR_PHY_OFFSET + 0x5c) /* Data Training Data Register 1 */

#define DDRP_DCUAR  (DDR_PHY_OFFSET + 0xc0) /* DCU Address Register */
#define DDRP_DCUDR  (DDR_PHY_OFFSET + 0xc4) /* DCU Data Register */
#define DDRP_DCURR  (DDR_PHY_OFFSET + 0xc8) /* DCU Run Register */
#define DDRP_DCULR  (DDR_PHY_OFFSET + 0xcc) /* DCU Loop Register */
#define DDRP_DCUGCR (DDR_PHY_OFFSET + 0xd0) /* DCU Gerneral Configuration Register */
#define DDRP_DCUTPR (DDR_PHY_OFFSET + 0xd4) /* DCU Timing Parameters Register */
#define DDRP_DCUSR0 (DDR_PHY_OFFSET + 0xd8) /* DCU Status Register 0 */
#define DDRP_DCUSR1 (DDR_PHY_OFFSET + 0xdc) /* DCU Status Register 1 */

#define DDRP_DXGCR(n)   (DDR_PHY_OFFSET + 0x1c0 + n * 0x40) /* DATX8 n General Configuration Register */
#define DDRP_DXGSR0(n)  (DDR_PHY_OFFSET + 0x1c4 + n * 0x40) /* DATX8 n General Status Register */
#define DDRP_DXGSR1(n)  (DDR_PHY_OFFSET + 0x1c8 + n * 0x40) /* DATX8 n General Status Register */
#define DDRP_DXDLLCR(n) (DDR_PHY_OFFSET + 0x1cc + n * 0x40) /* DATX8 n General Status Register */
#define DDRP_DXDQSTR(n) (DDR_PHY_OFFSET + 0x1d4 + n * 0x40) /* DATX8 n DQS Timing Register */
#define DDRP_ZQXCR0(n)  (DDR_PHY_OFFSET + 0x180 + n * 0x10) /* ZQ impedance Control Register 0 */
#define DDRP_ZQXCR1(n)  (DDR_PHY_OFFSET + 0x184 + n * 0x10) /* ZQ impedance Control Register 1 */
#define DDRP_ZQXSR0(n)  (DDR_PHY_OFFSET + 0x188 + n * 0x10) /* ZQ impedance Status Register 0 */
#define DDRP_ZQXSR1(n)  (DDR_PHY_OFFSET + 0x18c + n * 0x10) /* ZQ impedance Status Register 1 */

/* DDRC Status Register */
#define DDRC_ST_ENDIAN  (1 << 7) /* 0 Little data endian
                        1 Big data endian */
#define DDRC_DSTATUS_MISS   (1 << 6)
#define DDRC_ST_DPDN        (1 << 5) /* 0 DDR memory is NOT in deep-power-down state
                        1 DDR memory is in deep-power-down state */
#define DDRC_ST_PDN     (1 << 4) /* 0 DDR memory is NOT in power-down state
                        1 DDR memory is in power-down state */
#define DDRC_ST_AREF        (1 << 3) /* 0 DDR memory is NOT in auto-refresh state
                        1 DDR memory is in auto-refresh state */
#define DDRC_ST_SREF        (1 << 2) /* 0 DDR memory is NOT in self-refresh state
                        1 DDR memory is in self-refresh state */
#define DDRC_ST_CKE1        (1 << 1) /* 0 CKE1 Pin is low
                        1 CKE1 Pin is high */
#define DDRC_ST_CKE0        (1 << 0) /* 0 CKE0 Pin is low
                        1 CKE0 Pin is high */

