jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/* DDRC Configure Register */
#define DDRC_CFG_ROW1_BIT   27 /* Row Address width. */
#define DDRC_CFG_ROW1_MASK  (0x7 << DDRC_CFG_ROW1_BIT)
#define DDRC_CFG_COL1_BIT   24 /* Row Address width. */
#define DDRC_CFG_COL1_MASK  (0x7 << DDRC_CFG_COL1_BIT)
#define DDRC_CFG_BA1_BIT    23 /* Bank Address width of DDR memory */
#define DDRC_CFG_IMBA       (1 << 22)
#define DDRC_CFG_BL_BIT     21 /* Burst length for DDR chips */
#define DDRC_CFG_TYPE_BIT   17
//#define DDRC_CFG_TYPE_MASK    (0x7 << DDRC_CFG_TYPE_BIT)
#define DDRC_CFG_TYPE_DDR1  (2 << DDRC_CFG_TYPE_BIT)
#define DDRC_CFG_TYPE_MDDR  (3 << DDRC_CFG_TYPE_BIT)
#define DDRC_CFG_TYPE_DDR2  (4 << DDRC_CFG_TYPE_BIT)
#define DDRC_CFG_TYPE_LPDDR2    (5 << DDRC_CFG_TYPE_BIT)
#define DDRC_CFG_TYPE_DDR3  (6 << DDRC_CFG_TYPE_BIT)
//#define DDRC_CFG_ODT_EN       (1 << 16)  /* ODT EN */
#define DDRC_CFG_ODT_EN     1  /* ODT EN */
#define DDRC_CFG_ODT_EN_BIT 16  /* ODT EN */
#define DDRC_CFG_MISPE      (1 << 15)  /* mem protect */
#define DDRC_CFG_ROW0_BIT   11 /* Row Address width. */
#define DDRC_CFG_ROW0_MASK  (0x7 << DDRC_CFG_ROW0_BIT)
//#define DDRC_CFG_ROW_12   (0 << DDRC_CFG_ROW_BIT) /* 12-bit row address is used */
//#define DDRC_CFG_ROW_13   (1 << DDRC_CFG_ROW_BIT) /* 13-bit row address is used */
//#define DDRC_CFG_ROW_14   (2 << DDRC_CFG_ROW_BIT) /* 14-bit row address is used */
#define DDRC_CFG_COL0_BIT   8 /* Column Address width.
                     Specify the Column address width of external DDR. */
#define DDRC_CFG_COL0_MASK  (0x7 << DDRC_CFG_COL0_BIT)
//#define DDRC_CFG_COL_8    (0 << DDRC_CFG_COL_BIT) /* 8-bit Column address is used */
//#define DDRC_CFG_COL_9    (1 << DDRC_CFG_COL_BIT) /* 9-bit Column address is used */
//#define DDRC_CFG_COL_10   (2 << DDRC_CFG_COL_BIT) /* 10-bit Column address is used */
//#define DDRC_CFG_COL_11   (3 << DDRC_CFG_COL_BIT) /* 11-bit Column address is used */
#define DDRC_CFG_CS1EN_BIT  7 /* DDR Chip-Select-1 Enable */
#define DDRC_CFG_CS0EN_BIT  6 /* DDR Chip-Select-0 Enable */
//#define DDRC_CFG_CS1EN        (1 << 7) /* 0 DDR Pin CS1 un-used
//                      1 There're DDR memory connected to CS1 */
//#define DDRC_CFG_CS0EN        (1 << 6) /* 0 DDR Pin CS0 un-used
//                      1 There're DDR memory connected to CS0 */
#define DDRC_CFG_CL_BIT     2 /* CAS Latency */
//#define DDRC_CFG_CL_MASK  (0xf << DDRC_CFG_CL_BIT)
//#define DDRC_CFG_CL_3     (0 << DDRC_CFG_CL_BIT) /* CL = 3 tCK */
//#define DDRC_CFG_CL_4     (1 << DDRC_CFG_CL_BIT) /* CL = 4 tCK */
//#define DDRC_CFG_CL_5     (2 << DDRC_CFG_CL_BIT) /* CL = 5 tCK */
//#define DDRC_CFG_CL_6     (3 << DDRC_CFG_CL_BIT) /* CL = 6 tCK */
#define DDRC_CFG_BA0_BIT    1 /* Bank Address width of DDR memory */
//#define DDRC_CFG_BA0      (1 << 1) /* 0 4 bank device, Pin ba[1:0] valid, ba[2] un-used
//                      1 8 bank device, Pin ba[2:0] valid*/
#define DDRC_CFG_DW_BIT     0 /* External DDR Memory Data Width */
//#define DDRC_CFG_DW       (1 << 0) /*0 External memory data width is 16-bit
//                     1 External memory data width is 32-bit */

/* DDRC Control Register */
#define DDRC_CTRL_DFI_RST   (1 << 23)
#define DDRC_CTRL_DLL_RST   (1 << 22)
#define DDRC_CTRL_CTL_RST   (1 << 21)
#define DDRC_CTRL_CFG_RST   (1 << 20)
#define DDRC_CTRL_ACTPD     (1 << 15) /* 0 Precharge all banks before entering power-down
                         1 Do not precharge banks before entering power-down */
#define DDRC_CTRL_PDT_BIT   12 /* Power-Down Timer */
#define DDRC_CTRL_PDT_MASK  (0x7 << DDRC_CTRL_PDT_BIT)
#define DDRC_CTRL_PDT_DIS   (0 << DDRC_CTRL_PDT_BIT) /* power-down disabled */
#define DDRC_CTRL_PDT_8 (1 << DDRC_CTRL_PDT_BIT) /* Enter power-down after 8 tCK idle */
#define DDRC_CTRL_PDT_16    (2 << DDRC_CTRL_PDT_BIT) /* Enter power-down after 16 tCK idle */
#define DDRC_CTRL_PDT_32    (3 << DDRC_CTRL_PDT_BIT) /* Enter power-down after 32 tCK idle */
#define DDRC_CTRL_PDT_64    (4 << DDRC_CTRL_PDT_BIT) /* Enter power-down after 64 tCK idle */
#define DDRC_CTRL_PDT_128   (5 << DDRC_CTRL_PDT_BIT) /* Enter power-down after 128 tCK idle */
#define DDRC_CTRL_ACTSTP    (1 << 11)
#define DDRC_CTRL_PRET_BIT  8 /* Precharge Timer */
#define DDRC_CTRL_PRET_MASK (0x7 << DDRC_CTRL_PRET_BIT) /*  */
#define DDRC_CTRL_PRET_DIS  (0 << DDRC_CTRL_PRET_BIT) /* PRET function Disabled */
#define DDRC_CTRL_PRET_8    (1 << DDRC_CTRL_PRET_BIT) /* Precharge active bank after 8 tCK idle */
#define DDRC_CTRL_PRET_16   (2 << DDRC_CTRL_PRET_BIT) /* Precharge active bank after 16 tCK idle */
#define DDRC_CTRL_PRET_32   (3 << DDRC_CTRL_PRET_BIT) /* Precharge active bank after 32 tCK idle */
#define DDRC_CTRL_PRET_64   (4 << DDRC_CTRL_PRET_BIT) /* Precharge active bank after 64 tCK idle */
#define DDRC_CTRL_PRET_128  (5 << DDRC_CTRL_PRET_BIT) /* Precharge active bank after 128 tCK idle */

#define DDRC_CTRL_KEEPSR    (1 << 17)
#define DDRC_CTRL_DPD       (1 << 6) /* 1 Drive external MDDR device entering Deep-Power-Down mode */

#define DDRC_CTRL_SR        (1 << 5) /* 1 Drive external DDR device entering self-refresh mode
                        0 Drive external DDR device exiting self-refresh mode */
#define DDRC_CTRL_UNALIGN   (1 << 4) /* 0 Disable unaligned transfer on AXI BUS
                        1 Enable unaligned transfer on AXI BUS */
#define DDRC_CTRL_ALH       (1 << 3) /* Advanced Latency Hiding:
                        0 Disable ALH
                        1 Enable ALH */
#define DDRC_CTRL_RDC       (1 << 2) /* 0 dclk clock frequency is lower than 60MHz
                        1 dclk clock frequency is higher than 60MHz */
#define DDRC_CTRL_CKE       (1 << 1) /* 0 Not set CKE Pin High
                        1 Set CKE Pin HIGH */
#define DDRC_CTRL_RESET (1 << 0) /* 0 End resetting ddrc_controller
                        1 Resetting ddrc_controller */


/* DDRC Load-Mode-Register */
#define DDRC_LMR_DDR_ADDR_BIT   16 /* When performing a DDR command, DDRC_ADDR[13:0]
                          corresponding to external DDR address Pin A[13:0] */
#define DDRC_LMR_DDR_ADDR_MASK  (0x3fff << DDRC_LMR_DDR_ADDR_BIT)

#define DDRC_LMR_BA_BIT     8 /* When performing a DDR command, BA[2:0]
                     corresponding to external DDR address Pin BA[2:0]. */
#define DDRC_LMR_BA_MASK    (0x7 << DDRC_LMR_BA_BIT)
/* For DDR2 */
#define DDRC_LMR_BA_MRS (0 << DDRC_LMR_BA_BIT) /* Mode Register set */
#define DDRC_LMR_BA_EMRS1   (1 << DDRC_LMR_BA_BIT) /* Extended Mode Register1 set */
#define DDRC_LMR_BA_EMRS2   (2 << DDRC_LMR_BA_BIT) /* Extended Mode Register2 set */
#define DDRC_LMR_BA_EMRS3   (3 << DDRC_LMR_BA_BIT) /* Extended Mode Register3 set */
/* For mobile DDR */
#define DDRC_LMR_BA_M_MRS   (0 << DDRC_LMR_BA_BIT) /* Mode Register set */
#define DDRC_LMR_BA_M_EMRS  (2 << DDRC_LMR_BA_BIT) /* Extended Mode Register set */
#define DDRC_LMR_BA_M_SR    (1 << DDRC_LMR_BA_BIT) /* Status Register set */
/* For Normal DDR1 */
#define DDRC_LMR_BA_N_MRS   (0 << DDRC_LMR_BA_BIT) /* Mode Register set */
#define DDRC_LMR_BA_N_EMRS  (1 << DDRC_LMR_BA_BIT) /* Extended Mode Register set */

