jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
#define DDRC_LMR_CMD_BIT    4
#define DDRC_LMR_CMD_MASK   (0x3 << DDRC_LMR_CMD_BIT)
#define DDRC_LMR_CMD_PREC   (0 << DDRC_LMR_CMD_BIT)/* Precharge one bank/All banks */
#define DDRC_LMR_CMD_AUREF  (1 << DDRC_LMR_CMD_BIT)/* Auto-Refresh */
#define DDRC_LMR_CMD_LMR    (2 << DDRC_LMR_CMD_BIT)/* Load Mode Register */

#define DDRC_LMR_START      (1 << 0) /* 0 No command is performed
                            1 On the posedge of START, perform a command
                            defined by CMD field */

/* DDRC Timing Config Register 1 */
#define DDRC_TIMING1_tRTP_BIT   24 /* READ to PRECHARGE command period. */
#define DDRC_TIMING1_tRTP_MASK  (0x3f << DDRC_TIMING1_tRTP_BIT)
#define DDRC_TIMING1_tWTR_BIT   16 /* WRITE to READ command delay. */
#define DDRC_TIMING1_tWTR_MASK  (0x3f << DDRC_TIMING1_tWTR_BIT)
#define DDRC_TIMING1_tWTR_1     (0 << DDRC_TIMING1_tWTR_BIT)
#define DDRC_TIMING1_tWTR_2     (1 << DDRC_TIMING1_tWTR_BIT)
#define DDRC_TIMING1_tWTR_3     (2 << DDRC_TIMING1_tWTR_BIT)
#define DDRC_TIMING1_tWTR_4     (3 << DDRC_TIMING1_tWTR_BIT)
#define DDRC_TIMING1_tWR_BIT    8 /* WRITE Recovery Time defined by register MR of DDR2 DDR3 memory */
#define DDRC_TIMING1_tWR_MASK   (0x3f << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWR_1      (0 << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWR_2      (1 << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWR_3      (2 << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWR_4      (3 << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWR_5      (4 << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWR_6      (5 << DDRC_TIMING1_tWR_BIT)
#define DDRC_TIMING1_tWL_BIT    0 /* Write latency = RL - 1 */
#define DDRC_TIMING1_tWL_MASK   (0x3f << DDRC_TIMING1_tWL_BIT)

/* DDRC Timing Config Register 2 */
#define DDRC_TIMING2_tCCD_BIT   24 /* CAS# to CAS# command delay */
#define DDRC_TIMING2_tCCD_MASK  (0x3f << DDRC_TIMING2_tCCD_BIT)
#define DDRC_TIMING2_tRAS_BIT   16 /* ACTIVE to PRECHARGE command period (2 * tRAS + 1) */
#define DDRC_TIMING2_tRAS_MASK  (0x3f << DDRC_TIMING2_tRAS_BIT)
#define DDRC_TIMING2_tRCD_BIT   8  /* ACTIVE to READ or WRITE command period. */
#define DDRC_TIMING2_tRCD_MASK  (0x3f << DDRC_TIMING2_tRCD_BIT)
#define DDRC_TIMING2_tRL_BIT    0  /* Read latency = AL + CL*/
#define DDRC_TIMING2_tRL_MASK   (0x3f << DDRC_TIMING2_tRL_BIT)

/* DDRC Timing Config Register 3 */
#define DDRC_TIMING3_ONUM_BIT  27
#define DDRC_TIMING3_tCKSRE_BIT     24 /* Valid clock after enter self-refresh. */
#define DDRC_TIMING3_tCKSRE_MASK    (0x3f << DDRC_TIMING3_tCKSRE_BIT)
#define DDRC_TIMING3_tRP_BIT    16 /* PRECHARGE command period. */
#define DDRC_TIMING3_tRP_MASK   (0x3f << DDRC_TIMING3_tRP_BIT)
#define DDRC_TIMING3_tRRD_BIT   8 /* ACTIVE bank A to ACTIVE bank B command period. */
#define DDRC_TIMING3_tRRD_MASK  (0x3f << DDRC_TIMING3_tRRD_BIT)
#define DDRC_TIMING3_tRRD_DISABLE   (0 << DDRC_TIMING3_tRRD_BIT)
#define DDRC_TIMING3_tRRD_2     (1 << DDRC_TIMING3_tRRD_BIT)
#define DDRC_TIMING3_tRRD_3     (2 << DDRC_TIMING3_tRRD_BIT)
#define DDRC_TIMING3_tRRD_4     (3 << DDRC_TIMING3_tRRD_BIT)
#define DDRC_TIMING3_tRC_BIT    0 /* ACTIVE to ACTIVE command period. */
#define DDRC_TIMING3_tRC_MASK   (0x3f << DDRC_TIMING3_tRC_BIT)

/* DDRC Timing Config Register 4 */
#define DDRC_TIMING4_tRFC_BIT         24 /* AUTO-REFRESH command period. */
#define DDRC_TIMING4_tRFC_MASK        (0x3f << DDRC_TIMING4_tRFC_BIT)
#define DDRC_TIMING4_tEXTRW_BIT       21 /* ??? */
#define DDRC_TIMING4_tEXTRW_MASK      (0x7 << DDRC_TIMING4_tEXTRW_BIT)
#define DDRC_TIMING4_tRWCOV_BIT       19 /* ??? */
#define DDRC_TIMING4_tRWCOV_MASK      (0x3 << DDRC_TIMING4_tRWCOV_BIT)
#define DDRC_TIMING4_tCKE_BIT         16 /* ??? */
#define DDRC_TIMING4_tCKE_MASK        (0x7 << DDRC_TIMING4_tCKE_BIT)
#define DDRC_TIMING4_tMINSR_BIT       8  /* Minimum Self-Refresh / Deep-Power-Down time */
#define DDRC_TIMING4_tMINSR_MASK      (0xf << DDRC_TIMING4_tMINSR_BIT)
#define DDRC_TIMING4_tXP_BIT          4  /* EXIT-POWER-DOWN to next valid command period. */
#define DDRC_TIMING4_tXP_MASK         (0x7 << DDRC_TIMING4_tXP_BIT)
#define DDRC_TIMING4_tMRD_BIT         0  /* Load-Mode-Register to next valid command period. */
#define DDRC_TIMING4_tMRD_MASK        (0x3 << DDRC_TIMING4_tMRD_BIT)

/* DDRC Timing Config Register 5 */
#define DDRC_TIMING5_tCTLUPD_BIT    24 /* ??? */
#define DDRC_TIMING4_tCTLUPD_MASK   (0x3f << DDRC_TIMING5_tCTLUDP_BIT)
#define DDRC_TIMING5_tRTW_BIT       16 /* ??? */
#define DDRC_TIMING5_tRTW_MASK      (0x3f << DDRC_TIMING5_tRTW_BIT)
#define DDRC_TIMING5_tRDLAT_BIT     8 /* RL - 2 */
#define DDRC_TIMING5_tRDLAT_MASK    (0x3f << DDRC_TIMING5_tRDLAT_BIT)
#define DDRC_TIMING5_tWDLAT_BIT     0 /* WL - 1 */
#define DDRC_TIMING5_tWDLAT_MASK    (0x3f << DDRC_TIMING5_tWDLAT_BIT)

/* DDRC Timing Config Register 6 */
#define DDRC_TIMING6_tXSRD_BIT      24 /* exit power-down to READ delay */
#define DDRC_TIMING6_tXSRD_MASK     (0x3f << DDRC_TIMING6_tXSRD_BIT)
#define DDRC_TIMING6_tFAW_BIT       16 /* 4-active command window */
#define DDRC_TIMING6_tFAW_MASK      (0x3f << DDRC_TIMING6_tFAW_BIT)
#define DDRC_TIMING6_tCFGW_BIT      8 /* Write PHY configure registers to other commands delay */
#define DDRC_TIMING6_tCFGW_MASK     (0x3f << DDRC_TIMING6_tCFGW_BIT)
#define DDRC_TIMING6_tCFGR_BIT      0 /* Ready PHY configure registers to other commands delay */
#define DDRC_TIMING6_tCFGR_MASK     (0x3f << DDRC_TIMING6_tCFGR_BIT)

/* DDRC  Auto-Refresh Counter */
#define DDRC_REFCNT_CON_BIT           16 /* Constant value used to compare with CNT value. */
#define DDRC_REFCNT_CON_MASK          (0xff << DDRC_REFCNT_CON_BIT)
#define DDRC_REFCNT_CNT_BIT           8  /* 8-bit counter */
#define DDRC_REFCNT_CNT_MASK          (0xff << DDRC_REFCNT_CNT_BIT)
#define DDRC_REFCNT_CLK_DIV_BIT        1  /* Clock Divider for auto-refresh counter. */
#define DDRC_REFCNT_CLK_DIV_MASK       (0x7 << DDRC_REFCNT_CLKDIV_BIT)
#define DDRC_REFCNT_REF_EN            (1 << 0) /* Enable Refresh Counter */

/* DDRC DQS Delay Control Register */
#define DDRC_DQS_ERROR                (1 << 29) /* ahb_clk Delay Detect ERROR, read-only. */
#define DDRC_DQS_READY                (1 << 28) /* ahb_clk Delay Detect READY, read-only. */
#define DDRC_DQS_AUTO                 (1 << 23) /* Hardware auto-detect & set delay line */
#define DDRC_DQS_DET                  (1 << 24) /* Start delay detecting. */
#define DDRC_DQS_SRDET                (1 << 25) /* Hardware auto-redetect & set delay line. */
#define DDRC_DQS_CLKD_BIT             16 /* CLKD is reference value for setting WDQS and RDQS.*/
#define DDRC_DQS_CLKD_MASK            (0x3f << DDRC_DQS_CLKD_BIT)
#define DDRC_DQS_WDQS_BIT             8  /* Set delay element number to write DQS delay-line. */
#define DDRC_DQS_WDQS_MASK            (0x3f << DDRC_DQS_WDQS_BIT)
#define DDRC_DQS_RDQS_BIT             0  /* Set delay element number to read DQS delay-line. */
#define DDRC_DQS_RDQS_MASK            (0x3f << DDRC_DQS_RDQS_BIT)

/* DDRC DQS Delay Adjust Register */
#define DDRC_DQS_ADJWDQS_BIT          8 /* The adjust value for WRITE DQS delay */
#define DDRC_DQS_ADJWDQS_MASK         (0x1f << DDRC_DQS_ADJWDQS_BIT)
#define DDRC_DQS_ADJRDQS_BIT          0 /* The adjust value for READ DQS delay */
#define DDRC_DQS_ADJRDQS_MASK         (0x1f << DDRC_DQS_ADJRDQS_BIT)

/* DDRC Memory Map Config Register */
#define DDRC_MMAP_BASE_BIT            8 /* base address */
#define DDRC_MMAP_BASE_MASK           (0xff << DDRC_MMAP_BASE_BIT)
#define DDRC_MMAP_MASK_BIT            0 /* address mask */
#define DDRC_MMAP_MASK_MASK           (0xff << DDRC_MMAP_MASK_BIT)

#define DDRC_MMAP0_BASE          (0x20 << DDRC_MMAP_BASE_BIT)
#define DDRC_MMAP1_BASE_64M (0x24 << DDRC_MMAP_BASE_BIT) /*when bank0 is 128M*/
#define DDRC_MMAP1_BASE_128M    (0x28 << DDRC_MMAP_BASE_BIT) /*when bank0 is 128M*/
#define DDRC_MMAP1_BASE_256M    (0x30 << DDRC_MMAP_BASE_BIT) /*when bank0 is 128M*/

#define DDRC_MMAP_MASK_64_64    (0xfc << DDRC_MMAP_MASK_BIT)  /*mask for two 128M SDRAM*/
#define DDRC_MMAP_MASK_128_128  (0xf8 << DDRC_MMAP_MASK_BIT)  /*mask for two 128M SDRAM*/
#define DDRC_MMAP_MASK_256_256  (0xf0 << DDRC_MMAP_MASK_BIT)  /*mask for two 128M SDRAM*/

/* DDRP PHY Initialization Register */
#define DDRP_PIR_INIT       (1 << 0)
#define DDRP_PIR_DLLSRST    (1 << 1)
#define DDRP_PIR_DLLLOCK    (1 << 2)
#define DDRP_PIR_ZCAL       (1 << 3)
#define DDRP_PIR_ITMSRST    (1 << 4)
#define DDRP_PIR_DRAMRST    (1 << 5)
#define DDRP_PIR_DRAMINT    (1 << 6)
#define DDRP_PIR_QSTRN      (1 << 7)
#define DDRP_PIR_RVTRN      (1 << 8)
#define DDRP_PIR_DLLBYP     (1 << 17)
/* DDRP PHY General Configurate Register */
#define DDRP_PGCR_ITMDMD    (1 << 0)
#define DDRP_PGCR_DQSCFG    (1 << 1)
#define DDRP_PGCR_DFTCMP    (1 << 2)
#define DDRP_PGCR_DFTLMT_BIT    3
#define DDRP_PGCR_DTOSEL_BIT    5
#define DDRP_PGCR_CKEN_BIT  9
#define DDRP_PGCR_CKDV_BIT  12
#define DDRP_PGCR_CKINV     (1 << 14)
#define DDRP_PGCR_RANKEN_BIT    18
#define DDRP_PGCR_ZCKSEL_32 (2 << 22)
#define DDRP_PGCR_PDDISDX   (1 << 24)
/* DDRP PHY General Status Register */
#define DDRP_PGSR_IDONE     (1 << 0)
#define DDRP_PGSR_DLDONE    (1 << 1)
#define DDRP_PGSR_ZCDONE    (1 << 2)
#define DDRP_PGSR_DIDONE    (1 << 3)
#define DDRP_PGSR_DTDONE    (1 << 4)
#define DDRP_PGSR_DTERR     (1 << 5)
#define DDRP_PGSR_DTIERR    (1 << 6)
#define DDRP_PGSR_DFTEERR   (1 << 7)
/* DDRP DRAM Configuration Register */
#define DDRP_DCR_TYPE_BIT   0
#define DDRP_DCR_TYPE_MASK  (0x7 << DDRP_DCR_TYPE_BIT)
#define DDRP_DCR_TYPE_MDDR  (0 << DDRP_DCR_TYPE_BIT)
#define DDRP_DCR_TYPE_DDR   (1 << DDRP_DCR_TYPE_BIT)
#define DDRP_DCR_TYPE_DDR2  (2 << DDRP_DCR_TYPE_BIT)
#define DDRP_DCR_TYPE_DDR3  (3 << DDRP_DCR_TYPE_BIT)
#define DDRP_DCR_TYPE_LPDDR2    (4 << DDRP_DCR_TYPE_BIT)
#define DDRP_DCR_DDR8BNK_BIT    3
#define DDRP_DCR_DDR8BNK_MASK   (1 << DDRP_DCR_DDR8BNK_BIT)
#define DDRP_DCR_DDR8BNK    (1 << DDRP_DCR_DDR8BNK_BIT)
#define DDRP_DCR_DDR8BNK_DIS    (0 << DDRP_DCR_DDR8BNK_BIT)
/* DDRP PHY Timing Register 0 */
/* DDRP PHY Timing Register 1 */
/* DDRP PHY Timing Register 2 */
#define DDRP_PTR0_tDLLSRST      50      // 50ns
#define DDRP_PTR0_tDLLSRST_BIT  0
#define DDRP_PTR0_tDLLLOCK  5120        // 5.12us
#define DDRP_PTR0_tDLLLOCK_BIT  6
#define DDRP_PTR0_tITMSRST_8    8       // 8tck
#define DDRP_PTR0_tITMSRST_BIT  18
#define DDRP_PTR1_tDINIT1_BIT   19
#define DDRP_PTR1_tDINIT0_DDR3  500 * 1000  // 500us
#define DDRP_PTR1_tDINIT0_BIT   0
#define DDRP_PTR2_tDINIT2_BIT   0
#define DDRP_PTR2_tDINIT2_DDR3  200 * 1000  // 200us
#define DDRP_PTR2_tDINIT3_BIT   17
#define DDRP_PTR2_tDINIT3_DDR3  512         // 512 tck

