jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/* DDRP DRAM Timing Parameters Register 0 */
#define DDRP_DTPR0_tCCD_BIT 31
#define DDRP_DTPR0_tRC_BIT  25
#define DDRP_DTPR0_tRRD_BIT 21
#define DDRP_DTPR0_tRAS_BIT 16
#define DDRP_DTPR0_tRCD_BIT 12
#define DDRP_DTPR0_tRP_BIT  8
#define DDRP_DTPR0_tWTR_BIT 5
#define DDRP_DTPR0_tRTP_BIT 2
#define DDRP_DTPR0_tMRD_BIT 0
/* DDRP DRAM Timing Parameters Register 1 */
#define DRP_DTRP1_RTODT  (1 << 11)    /* ODT may not be turned on until one clock after the read post-amble */
#define DDRP_DTPR1_tRFC_BIT 16
#define DDRP_DTPR1_tRTODT_BIT   11
#define DDRP_DTPR1_tMOD_BIT 9
#define DDRP_DTPR1_tFAW_BIT 3
/* DDRP DRAM Timing Parameters Register 2 */
#define DDRP_DTPR2_tDLLK_BIT    19
#define DDRP_DTPR2_tCKE_BIT 15
#define DDRP_DTPR2_tXP_BIT  10
#define DDRP_DTPR2_tXS_BIT  0
/* DDRP DATX8 n Gen#define eral Configuration Register */
#define DDRP_DXGCR_DXEN  (1 << 0)    /* Data Byte Enable */

#define DDRP_ZQXCR_ZDEN_BIT     28
#define DDRP_ZQXCR_ZDEN         (1 << DDRP_ZQXCR_ZDEN_BIT)
#define DDRP_ZQXCR_PULLUP_IMPED_BIT 5
#define DDRP_ZQXCR_PULLDOWN_IMPED_BIT   0

/* DDR Mode Register Set*/
#define DDR1_MRS_OM_BIT     7        /* Operating Mode */
#define DDR1_MRS_OM_MASK    (0x3f << DDR1_MRS_OM_BIT)
#define DDR1_MRS_OM_NORMAL  (0 << DDR1_MRS_OM_BIT)
#define DDR1_MRS_OM_TEST    (1 << DDR1_MRS_OM_BIT)
#define DDR1_MRS_OM_DLLRST  (2 << DDR1_MRS_OM_BIT)
#define DDR_MRS_CAS_BIT     4        /* CAS Latency */
#define DDR_MRS_CAS_MASK    (7 << DDR_MRS_CAS_BIT)
#define DDR_MRS_BT_BIT      3        /* Burst Type */
#define DDR_MRS_BT_MASK     (1 << DDR_MRS_BT_BIT)
#define DDR_MRS_BT_SEQ  (0 << DDR_MRS_BT_BIT) /* Sequential */
#define DDR_MRS_BT_INT  (1 << DDR_MRS_BT_BIT) /* Interleave */
#define DDR_MRS_BL_BIT      0        /* Burst Length */
#define DDR_MRS_BL_MASK     (7 << DDR_MRS_BL_BIT)
#define DDR_MRS_BL_4        (2 << DDR_MRS_BL_BIT)
#define DDR_MRS_BL_8        (3 << DDR_MRS_BL_BIT)
/* DDR1 Extended Mode Register */
#define DDR1_EMRS_OM_BIT    2   /* Partial Array Self Refresh */
#define DDR1_EMRS_OM_MASK   (0x3ff << DDR1_EMRS_OM_BIT)
#define DDR1_EMRS_OM_NORMAL (0 << DDR1_EMRS_OM_BIT) /*All Banks*/

#define DDR1_EMRS_DS_BIT    1   /* Driver strength */
#define DDR1_EMRS_DS_MASK   (1 << DDR1_EMRS_DS_BIT)
#define DDR1_EMRS_DS_FULL   (0 << DDR1_EMRS_DS_BIT) /*Full*/
#define DDR1_EMRS_DS_HALF   (1 << DDR1_EMRS_DS_BIT) /*1/2 Strength*/

#define DDR1_EMRS_DLL_BIT   0   /* Driver strength */
#define DDR1_EMRS_DLL_MASK  (1 << DDR1_EMRS_DLL_BIT)
#define DDR1_EMRS_DLL_EN    (0 << DDR1_EMRS_DLL_BIT)    /*Full*/
#define DDR1_EMRS_DLL_DIS   (1 << DDR1_EMRS_DLL_BIT)    /*1/2 Strength*/

/* MDDR Mode Register Set*/
/* Mobile SDRAM Extended Mode Register */
#define DDR_EMRS_DS_BIT     5   /* Driver strength */
#define DDR_EMRS_DS_MASK    (3 << DDR_EMRS_DS_BIT)
#define DDR_EMRS_DS_FULL    (0 << DDR_EMRS_DS_BIT)  /*Full*/
#define DDR_EMRS_DS_HALF    (1 << DDR_EMRS_DS_BIT)  /*1/2 Strength*/
#define DDR_EMRS_DS_QUTR    (2 << DDR_EMRS_DS_BIT)  /*1/4 Strength*/

#define DDR_EMRS_PRSR_BIT   0   /* Partial Array Self Refresh */
#define DDR_EMRS_PRSR_MASK  (7 << DDR_EMRS_PRSR_BIT)
#define DDR_EMRS_PRSR_ALL   (0 << DDR_EMRS_PRSR_BIT) /*All Banks*/
#define DDR_EMRS_PRSR_HALF_TL   (1 << DDR_EMRS_PRSR_BIT) /*Half of Total Bank*/
#define DDR_EMRS_PRSR_QUTR_TL   (2 << DDR_EMRS_PRSR_BIT) /*Quarter of Total Bank*/
#define DDR_EMRS_PRSR_HALF_B0   (5 << DDR_EMRS_PRSR_BIT) /*Half of Bank0*/
#define DDR_EMRS_PRSR_QUTR_B0   (6 << DDR_EMRS_PRSR_BIT) /*Quarter of Bank0*/

/* DDR2 Mode Register Set*/
#define DDR2_MRS_PD_BIT     10 /* Active power down exit time */
#define DDR2_MRS_PD_MASK    (1 << DDR_MRS_PD_BIT)
#define DDR2_MRS_PD_FAST_EXIT   (0 << 10)
#define DDR2_MRS_PD_SLOW_EXIT   (1 << 10)
#define DDR2_MRS_WR_BIT     9 /* Write Recovery for autoprecharge */
#define DDR2_MRS_WR_MASK    (7 << DDR_MRS_WR_BIT)
#define DDR2_MRS_DLL_RST    (1 << 8) /* DLL Reset */
#define DDR2_MRS_TM_BIT     7        /* Operating Mode */
#define DDR2_MRS_TM_MASK    (1 << DDR_MRS_TM_BIT)
#define DDR2_MRS_TM_NORMAL  (0 << DDR_MRS_TM_BIT)
#define DDR2_MRS_TM_TEST    (1 << DDR_MRS_TM_BIT)
/* DDR2 Extended Mode Register1 Set */
#define DDR_EMRS1_QOFF      (1<<12) /* 0 Output buffer enabled
                       1 Output buffer disabled */
#define DDR_EMRS1_RDQS_EN   (1<<11) /* 0 Disable
                       1 Enable */
#define DDR_EMRS1_DQS_DIS   (1<<10) /* 0 Enable
                       1 Disable */
#define DDR_EMRS1_OCD_BIT   7 /* Additive Latency 0 -> 6 */
#define DDR_EMRS1_OCD_MASK  (0x7 << DDR_EMRS1_OCD_BIT)
#define DDR_EMRS1_OCD_EXIT      (0 << DDR_EMRS1_OCD_BIT)
#define DDR_EMRS1_OCD_D0        (1 << DDR_EMRS1_OCD_BIT)
#define DDR_EMRS1_OCD_D1        (2 << DDR_EMRS1_OCD_BIT)
#define DDR_EMRS1_OCD_ADJ       (4 << DDR_EMRS1_OCD_BIT)
#define DDR_EMRS1_OCD_DFLT      (7 << DDR_EMRS1_OCD_BIT)
#define DDR_EMRS1_AL_BIT    3 /* Additive Latency 0 -> 6 */
#define DDR_EMRS1_AL_MASK   (7 << DDR_EMRS1_AL_BIT)
#define DDR_EMRS1_RTT_BIT   2 /* On Die Termination */
#define DDR_EMRS1_RTT_MASK  (0x11 << DDR_EMRS1_RTT_BIT) /* Bit 6 and  Bit 2 */
#define DDR_EMRS1_RTT_DIS   (0x00 << DDR_EMRS1_RTT_BIT)
#define DDR_EMRS1_RTT_75    (0x01 << DDR_EMRS1_RTT_BIT)
#define DDR_EMRS1_RTT_150   (0x10 << DDR_EMRS1_RTT_BIT)
#define DDR_EMRS1_RTT_50    (0x11 << DDR_EMRS1_RTT_BIT)
#define DDR_EMRS1_DIC_BIT   1        /* Output Driver Impedence Control */
#define DDR_EMRS1_DIC_MASK  (1 << DDR_EMRS1_DIC_BIT) /* 100% */
#define DDR_EMRS1_DIC_NORMAL    (0 << DDR_EMRS1_DIC_BIT) /* 60% */
#define DDR_EMRS1_DIC_HALF  (1 << DDR_EMRS1_DIC_BIT)
#define DDR_EMRS1_DLL_BIT   0        /* DLL Enable  */
#define DDR_EMRS1_DLL_MASK  (1 << DDR_EMRS1_DLL_BIT)
#define DDR_EMRS1_DLL_EN    (0 << DDR_EMRS1_DLL_BIT)
#define DDR_EMRS1_DLL_DIS   (1 << DDR_EMRS1_DLL_BIT)

/* LPDDR2 Mode2 Register Set*/
#define LPDDR2_MRS2_BL_BIT      0        /* Burst Length */
#define LPDDR2_MRS2_BL_MASK     (7 << DDR_MRS_BL_BIT)
#define LPDDR2_MRS2_BL_4        (2 << DDR_MRS_BL_BIT)
#define LPDDR2_MRS2_BL_8        (3 << DDR_MRS_BL_BIT)
#define LPDDR2_MRS2_BL_16       (4 << DDR_MRS_BL_BIT)

