jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/* DDR3 Mode Register Set*/
#define DDR3_MR0_BL_BIT     0
#define DDR3_MR0_BL_MASK    (3 << DDR3_MR0_BL_BIT)
#define DDR3_MR0_BL_8       (0 << DDR3_MR0_BL_BIT)
#define DDR3_MR0_BL_fly (1 << DDR3_MR0_BL_BIT)
#define DDR3_MR0_BL_4       (2 << DDR3_MR0_BL_BIT)
#define DDR3_MR0_BT_BIT     3
#define DDR3_MR0_BT_MASK    (1 << DDR3_MR0_BT_BIT)
#define DDR3_MR0_BT_SEQ     (0 << DDR3_MR0_BT_BIT)
#define DDR3_MR0_BT_INTER   (1 << DDR3_MR0_BT_BIT)
#define DDR3_MR0_CL2_BIT    2
#define DDR3_MR0_CL4_BIT    4
#define DDR3_MR0_WR_BIT     9

#define DDR3_MR1_DLL_DISABLE    1
#define DDR3_MR1_DIC_6      (0 << 5 | 0 << 1)
#define DDR3_MR1_DIC_7      (0 << 5 | 1 << 1)
#define DDR3_MR1_RTT_DIS    (0 << 9 | 0 << 6 | 0 << 2)
#define DDR3_MR1_RTT_4      (0 << 9 | 0 << 6 | 1 << 2)
#define DDR3_MR1_RTT_2      (0 << 9 | 1 << 6 | 0 << 2)
#define DDR3_MR1_RTT_6      (0 << 9 | 1 << 6 | 1 << 2)
#define DDR3_MR1_RTT_12     (1 << 9 | 0 << 6 | 0 << 2)
#define DDR3_MR1_RTT_8      (1 << 9 | 0 << 6 | 1 << 2)

#define DDR3_MR2_CWL_BIT    3


#define DDRC_MDELAY_MAUTO_BIT (6)
#define DDRC_MDELAY_MAUTO  (1 << DDRC_MDELAY_MAUTO_BIT)

#define ddr_writel(value, reg)  writel((value), DDRC_BASE + reg)
#define ddr_readl(reg)      readl(DDRC_BASE + reg)

#define ddr_apb_writel(value, reg)  writel((value), DDRC_APB_BASE + reg)
#define ddr_apb_readl(reg)      readl(DDRC_APB_BASE + reg)

#ifdef MAX
#undef MAX
#endif
#define MAX(tck, time)                              \
({                                      \
    unsigned long value;                            \
    value = (tck * tck_g.ps > time) ? (tck * tck_g.ps) : time;      \
    value = (value % 1000 == 0) ? (value / 1000) : (value / 1000 + 1);  \
    value;                                  \
})

#define DDR_GET_VALUE(x, y)                 \
({                              \
    unsigned long value, temp;                      \
     temp = x * 1000;                   \
     value = (temp % y == 0) ? (temp / y) : (temp / y + 1); \
     value;                         \
 })

/*only for lpddr2 tRL and tWL*/
#define MATCH(clk,type)                             \
({                                      \
    unsigned long value,i;                          \
    if(type == 0){    \
        for(i = 0; i < ARRAY_SIZE(rl_LPDDR2);i++){      \
            if(rl_LPDDR2[i].memclk > clk){              \
                value = rl_LPDDR2[i].RL;              \
                break;                                  \
            }                           \
        }                                   \
    }else{  \
        for(i = 0; i < ARRAY_SIZE(wl_LPDDR2);i++){      \
            if(wl_LPDDR2[i].memclk > clk){              \
                value = wl_LPDDR2[i].WL;  \
                break;              \
            }               \
        }           \
    }           \
    value;              \
})


#endif  /* !__ASSEMBLY__ */


/*
 * The following macros are especially useful for __asm__
 * inline assembler.
 */
#ifndef __STR
#define __STR(x) #x
#endif
#ifndef STR
#define STR(x) __STR(x)
#endif

/*
 *  Configure language
 */
#ifdef __ASSEMBLY__
#define _ULCAST_
#else
#define _ULCAST_ (unsigned long)
#endif


#define     zero    $0      /* wired zero           */
#define     AT      $1      /* assembler temp  - uppercase because of ".set at" */
#define     v0      $2      /* return value         */
#define     v1      $3
#define     a0      $4      /* argument registers   */
#define     a1      $5
#define     a2      $6
#define     a3      $7
#define     t0      $8      /* caller saved         */
#define     t1      $9
#define     t2      $10
#define     t3      $11
#define     t4      $12
#define     t5      $13
#define     t6      $14
#define     t7      $15
#define     s0      $16     /* callee saved         */
#define     s1      $17
#define     s2      $18
#define     s3      $19
#define     s4      $20
#define     s5      $21
#define     s6      $22
#define     s7      $23
#define     t8      $24     /* caller saved         */
#define     t9      $25
#define     jp      $25     /* PIC jump register    */
#define     k0      $26     /* kernel scratch       */
#define     k1      $27
#define     gp      $28     /* global pointer       */
#define     sp      $29     /* stack pointer        */
#define     fp      $30     /* frame pointer        */
#define     s8      $30     /* same like fp!        */
#define     ra      $31     /* return address       */

/*
 * Cache Operations available on all MIPS processors with R4000-style caches
 */
#define     INDEX_INVALIDATE_I      0x00
#define     INDEX_WRITEBACK_INV_D   0x01
#define     INDEX_LOAD_TAG_I        0x04
#define     INDEX_LOAD_TAG_D        0x05
#define     INDEX_STORE_TAG_I       0x08
#define     INDEX_STORE_TAG_D       0x09
#define     HIT_INVALIDATE_I        0x10
#define     HIT_INVALIDATE_D        0x11
#define     HIT_WRITEBACK_INV_D     0x15

/*
 * R4000-specific cacheops
 */
#define     CREATE_DIRTY_EXCL_D     0x0d
#define     FILL                    0x14
#define     HIT_WRITEBACK_I         0x18
#define     HIT_WRITEBACK_D         0x19
#define     Index_Prefetch_I        0x1c

/*
 * R4000SC and R4400SC-specific cacheops
 */
#define     INDEX_INVALIDATE_SI     0x02
#define     INDEX_WRITEBACK_INV_SD  0x03
#define     INDEX_LOAD_TAG_SI       0x06
#define     INDEX_LOAD_TAG_SD       0x07
#define     INDEX_STORE_TAG_SI      0x0A
#define     INDEX_STORE_TAG_SD      0x0B
#define     CREATE_DIRTY_EXCL_SD    0x0f
#define     HIT_INVALIDATE_SI       0x12
#define     HIT_INVALIDATE_SD       0x13
#define     HIT_WRITEBACK_INV_SD    0x17
#define     HIT_WRITEBACK_SD        0x1b
#define     HIT_SET_VIRTUAL_SI      0x1e
#define     HIT_SET_VIRTUAL_SD      0x1f

/*
 * R5000-specific cacheops
 */
#define     R5K_PAGE_INVALIDATE_S   0x17

/*
 * RM7000-specific cacheops
 */
#define     PAGE_INVALIDATE_T       0x16

/*
 * R10000-specific cacheops
 *
 * Cacheops 0x02, 0x06, 0x0a, 0x0c-0x0e, 0x16, 0x1a and 0x1e are unused.
 * Most of the _S cacheops are identical to the R4000SC _SD cacheops.
 */
#define     INDEX_WRITEBACK_INV_S   0x03
#define     INDEX_LOAD_TAG_S        0x07
#define     INDEX_STORE_TAG_S       0x0B
#define     HIT_INVALIDATE_S        0x13
#define     CACHE_BARRIER           0x14
#define     HIT_WRITEBACK_INV_S     0x17
#define     INDEX_LOAD_DATA_I       0x18
#define     INDEX_LOAD_DATA_D       0x19
#define     INDEX_LOAD_DATA_S       0x1b
#define     INDEX_STORE_DATA_I      0x1c
#define     INDEX_STORE_DATA_D      0x1d
#define     INDEX_STORE_DATA_S      0x1f

