jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/* Bits specific to the R10000.  */
#define R10K_CONF_DN        (_ULCAST_(3) <<  3)
#define R10K_CONF_CT        (_ULCAST_(1) <<  5)
#define R10K_CONF_PE        (_ULCAST_(1) <<  6)
#define R10K_CONF_PM        (_ULCAST_(3) <<  7)
#define R10K_CONF_EC        (_ULCAST_(15)<<  9)
#define R10K_CONF_SB        (_ULCAST_(1) << 13)
#define R10K_CONF_SK        (_ULCAST_(1) << 14)
#define R10K_CONF_SS        (_ULCAST_(7) << 16)
#define R10K_CONF_SC        (_ULCAST_(7) << 19)
#define R10K_CONF_DC        (_ULCAST_(7) << 26)
#define R10K_CONF_IC        (_ULCAST_(7) << 29)

/* Bits specific to the VR41xx.  */
#define VR41_CONF_CS        (_ULCAST_(1) << 12)
#define VR41_CONF_P4K       (_ULCAST_(1) << 13)
#define VR41_CONF_BP        (_ULCAST_(1) << 16)
#define VR41_CONF_M16       (_ULCAST_(1) << 20)
#define VR41_CONF_AD        (_ULCAST_(1) << 23)

/* Bits specific to the R30xx.  */
#define R30XX_CONF_FDM      (_ULCAST_(1) << 19)
#define R30XX_CONF_REV      (_ULCAST_(1) << 22)
#define R30XX_CONF_AC       (_ULCAST_(1) << 23)
#define R30XX_CONF_RF       (_ULCAST_(1) << 24)
#define R30XX_CONF_HALT     (_ULCAST_(1) << 25)
#define R30XX_CONF_FPINT    (_ULCAST_(7) << 26)
#define R30XX_CONF_DBR      (_ULCAST_(1) << 29)
#define R30XX_CONF_SB       (_ULCAST_(1) << 30)
#define R30XX_CONF_LOCK     (_ULCAST_(1) << 31)

/* Bits specific to the TX49.  */
#define TX49_CONF_DC        (_ULCAST_(1) << 16)
#define TX49_CONF_IC        (_ULCAST_(1) << 17)  /* conflict with CONF_SC */
#define TX49_CONF_HALT      (_ULCAST_(1) << 18)
#define TX49_CONF_CWFON     (_ULCAST_(1) << 27)

/* Bits specific to the MIPS32/64 PRA.  */
#define MIPS_CONF_MT        (_ULCAST_(7) <<  7)
#define MIPS_CONF_AR        (_ULCAST_(7) << 10)
#define MIPS_CONF_AT        (_ULCAST_(3) << 13)
#define MIPS_CONF_M     (_ULCAST_(1) << 31)

/*
 * Bits in the MIPS32/64 PRA coprocessor 0 config registers 1 and above.
 */
#define MIPS_CONF1_FP       (_ULCAST_(1) <<  0)
#define MIPS_CONF1_EP       (_ULCAST_(1) <<  1)
#define MIPS_CONF1_CA       (_ULCAST_(1) <<  2)
#define MIPS_CONF1_WR       (_ULCAST_(1) <<  3)
#define MIPS_CONF1_PC       (_ULCAST_(1) <<  4)
#define MIPS_CONF1_MD       (_ULCAST_(1) <<  5)
#define MIPS_CONF1_C2       (_ULCAST_(1) <<  6)
#define MIPS_CONF1_DA       (_ULCAST_(7) <<  7)
#define MIPS_CONF1_DL       (_ULCAST_(7) << 10)
#define MIPS_CONF1_DS       (_ULCAST_(7) << 13)
#define MIPS_CONF1_IA       (_ULCAST_(7) << 16)
#define MIPS_CONF1_IL       (_ULCAST_(7) << 19)
#define MIPS_CONF1_IS       (_ULCAST_(7) << 22)
#define MIPS_CONF1_TLBS     (_ULCAST_(63)<< 25)

#define MIPS_CONF2_SA       (_ULCAST_(15)<<  0)
#define MIPS_CONF2_SL       (_ULCAST_(15)<<  4)
#define MIPS_CONF2_SS       (_ULCAST_(15)<<  8)
#define MIPS_CONF2_SU       (_ULCAST_(15)<< 12)
#define MIPS_CONF2_TA       (_ULCAST_(15)<< 16)
#define MIPS_CONF2_TL       (_ULCAST_(15)<< 20)
#define MIPS_CONF2_TS       (_ULCAST_(15)<< 24)
#define MIPS_CONF2_TU       (_ULCAST_(7) << 28)

#define MIPS_CONF3_TL       (_ULCAST_(1) <<  0)
#define MIPS_CONF3_SM       (_ULCAST_(1) <<  1)
#define MIPS_CONF3_MT       (_ULCAST_(1) <<  2)
#define MIPS_CONF3_SP       (_ULCAST_(1) <<  4)
#define MIPS_CONF3_VINT     (_ULCAST_(1) <<  5)
#define MIPS_CONF3_VEIC     (_ULCAST_(1) <<  6)
#define MIPS_CONF3_LPA      (_ULCAST_(1) <<  7)
#define MIPS_CONF3_DSP      (_ULCAST_(1) << 10)
#define MIPS_CONF3_ULRI     (_ULCAST_(1) << 13)

#define MIPS_CONF7_WII      (_ULCAST_(1) << 31)

#define MIPS_CONF7_RPS      (_ULCAST_(1) << 2)

/*
 * Bits in the MIPS32/64 coprocessor 1 (FPU) revision register.
 */
#define MIPS_FPIR_S     (_ULCAST_(1) << 16)
#define MIPS_FPIR_D     (_ULCAST_(1) << 17)
#define MIPS_FPIR_PS        (_ULCAST_(1) << 18)
#define MIPS_FPIR_3D        (_ULCAST_(1) << 19)
#define MIPS_FPIR_W     (_ULCAST_(1) << 20)
#define MIPS_FPIR_L     (_ULCAST_(1) << 21)
#define MIPS_FPIR_F64       (_ULCAST_(1) << 22)

#ifndef __ASSEMBLY__

#define cache_op(op, addr)      \
    __asm__ __volatile__(       \
        ".set   push\n"     \
        ".set   noreorder\n"    \
        ".set   mips3\n"    \
        "cache  %0, %1\n"   \
        ".set   pop\n"      \
        :           \
        : "i" (op), "R" (*(unsigned char *)(addr)))

#define CONFIG_SYS_DCACHE_SIZE      32768
#define CONFIG_SYS_ICACHE_SIZE      32768
#define CONFIG_SYS_CACHELINE_SIZE   32

/*
 * Memory segments (32bit kernel mode addresses)
 * These are the traditional names used in the 32-bit universe.
 */
#define KUSEG           0x00000000
#define KSEG0           0x80000000
#define KSEG1           0xa0000000
#define KSEG2           0xc0000000
#define KSEG3           0xe0000000

#define CKUSEG          0x00000000
#define CKSEG0          0x80000000
#define CKSEG1          0xa0000000
#define CKSEG2          0xc0000000
#define CKSEG3          0xe0000000

#define ASMMACRO(name, code...)                     \
__asm__(".macro " #name "; " #code "; .endm");              \
                                    \
static inline void name(void)                       \
{                                   \
    __asm__ __volatile__ (#name);                   \
}

ASMMACRO(_ssnop,
     sll    $0, $0, 1
    )

ASMMACRO(_ehb,
     sll    $0, $0, 3
    )


ASMMACRO(mtc0_tlbw_hazard,
    _ssnop; _ssnop; _ehb
    )
ASMMACRO(tlbw_use_hazard,
    _ssnop; _ssnop; _ssnop; _ehb
    )
ASMMACRO(tlb_probe_hazard,
     _ssnop; _ssnop; _ssnop; _ehb
    )
ASMMACRO(irq_enable_hazard,
     _ssnop; _ssnop; _ssnop; _ehb
    )
ASMMACRO(irq_disable_hazard,
    _ssnop; _ssnop; _ssnop; _ehb
    )
ASMMACRO(back_to_back_c0_hazard,
     _ssnop; _ssnop; _ssnop; _ehb
    )

/*
 * Functions to access the R10000 performance counters.  These are basically
 * mfc0 and mtc0 instructions from and to coprocessor register with a 5-bit
 * performance counter number encoded into bits 1 ... 5 of the instruction.
 * Only performance counters 0 to 1 actually exist, so for a non-R10000 aware
 * disassembler these will look like an access to sel 0 or 1.
 */
#define read_r10k_perf_cntr(counter)                \
({                              \
    unsigned int __res;                 \
    __asm__ __volatile__(                   \
    "mfpc\t%0, %1"                      \
    : "=r" (__res)                      \
    : "i" (counter));                   \
                                \
    __res;                          \
})

