jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
/*
 * Manipulate bits in a c0 register.
 */
#define __BUILD_SET_C0(name)                    \
static inline unsigned int                  \
set_c0_##name(unsigned int set)                 \
{                               \
    unsigned int res;                   \
                                \
    res = read_c0_##name();                 \
    res |= set;                     \
    write_c0_##name(res);                   \
                                \
    return res;                     \
}                               \
                                \
static inline unsigned int                  \
clear_c0_##name(unsigned int clear)             \
{                               \
    unsigned int res;                   \
                                \
    res = read_c0_##name();                 \
    res &= ~clear;                      \
    write_c0_##name(res);                   \
                                \
    return res;                     \
}                               \
                                \
static inline unsigned int                  \
change_c0_##name(unsigned int change, unsigned int new)     \
{                               \
    unsigned int res;                   \
                                \
    res = read_c0_##name();                 \
    res &= ~change;                     \
    res |= (new & change);                  \
    write_c0_##name(res);                   \
                                \
    return res;                     \
}

__BUILD_SET_C0(status)
__BUILD_SET_C0(cause)
__BUILD_SET_C0(config)
__BUILD_SET_C0(intcontrol)
__BUILD_SET_C0(intctl)
__BUILD_SET_C0(srsmap)


#define cache_prefetch_label(label, size)                  \
do{                                 \
    unsigned long addr,end;                     \
    /* Prefetch codes from label */                 \
    addr = (unsigned long)(&&label) & ~(32 - 1);            \
    end = (unsigned long)(&&label + (size)) & ~(32 - 1);      \
    end += 32;                          \
    for (; addr < end; addr += 32) {                \
        __asm__ volatile (                  \
                ".set mips32\n\t"           \
                " cache %0, 0(%1)\n\t"          \
                ".set mips32\n\t"           \
                :                   \
                : "I" (Index_Prefetch_I), "r"(addr));   \
    }                               \
}                                   \
while(0)

#define cache_prefetch_addr(address, size)                  \
do{                                 \
    unsigned long addr,end;                     \
    /* Prefetch codes from label */                 \
    addr = (unsigned long)(address) & ~(32 - 1);            \
    end = (unsigned long)(address + (size)) & ~(32 - 1);      \
    end += 32;                          \
    for (; addr < end; addr += 32) {                \
        __asm__ volatile (                  \
                ".set mips32\n\t"           \
                " cache %0, 0(%1)\n\t"          \
                ".set mips32\n\t"           \
                :                   \
                : "I" (Index_Prefetch_I), "r"(addr));   \
    }                               \
}                                   \
while(0)

ASMMACRO(enable_fpu_hazard,
     nop; nop; nop; nop
)

ASMMACRO(disable_fpu_hazard,
     _ehb
)

#define __enable_fpu()                          \
do {                                    \
    set_c0_status(ST0_CU1);                     \
    enable_fpu_hazard();                        \
} while (0)

#define __disable_fpu()                         \
do {                                    \
    clear_c0_status(ST0_CU1);                   \
    disable_fpu_hazard();                       \
} while (0)


#define disable_fpu()                           \
do {                                    \
    __disable_fpu();                    \
} while (0)

/*
 * read_barrier_depends - Flush all pending reads that subsequents reads
 * depend on.
 *
 * No data-dependent reads from memory-like regions are ever reordered
 * over this barrier.  All reads preceding this primitive are guaranteed
 * to access memory (but not necessarily other CPUs' caches) before any
 * reads following this primitive that depend on the data return by
 * any of the preceding reads.  This primitive is much lighter weight than
 * rmb() on most CPUs, and is never heavier weight than is
 * rmb().
 *
 * These ordering constraints are respected by both the local CPU
 * and the compiler.
 *
 * Ordering is not guaranteed by anything other than these primitives,
 * not even by data dependencies.  See the documentation for
 * memory_barrier() for examples and URLs to more information.
 *
 * For example, the following code would force ordering (the initial
 * value of "a" is zero, "b" is one, and "p" is "&a"):
 *
 * <programlisting>
 *  CPU 0               CPU 1
 *
 *  b = 2;
 *  memory_barrier();
 *  p = &b;             q = p;
 *                  read_barrier_depends();
 *                  d = *q;
 * </programlisting>
 *
 * because the read of "*q" depends on the read of "p" and these
 * two reads are separated by a read_barrier_depends().  However,
 * the following code, with the same initial values for "a" and "b":
 *
 * <programlisting>
 *  CPU 0               CPU 1
 *
 *  a = 2;
 *  memory_barrier();
 *  b = 3;              y = b;
 *                  read_barrier_depends();
 *                  x = a;
 * </programlisting>
 *
 * does not enforce ordering, since there is no data dependency between
 * the read of "a" and the read of "b".  Therefore, on some CPUs, such
 * as Alpha, "y" could be set to 3 and "x" to 0.  Use rmb()
 * in cases like this where there are no data dependencies.
 */

#define CONFIG_CPU_HAS_SYNC

#define read_barrier_depends()      do { } while(0)
#define smp_read_barrier_depends()  do { } while(0)

#ifdef CONFIG_CPU_HAS_SYNC
#define __sync()                \
    __asm__ __volatile__(           \
        ".set   push\n\t"       \
        ".set   noreorder\n\t"      \
        ".set   mips2\n\t"      \
        "sync\n\t"          \
        ".set   pop"            \
        : /* no output */       \
        : /* no input */        \
        : "memory")
#else
#define __sync()    do { } while(0)
#endif

