jiwei123/uboot_for_halley2/floader-m200/floader_m200.h
#define __fast_iob()                \
    __asm__ __volatile__(           \
        ".set   push\n\t"       \
        ".set   noreorder\n\t"      \
        "lw $0,%0\n\t"      \
        "nop\n\t"           \
        ".set   pop"            \
        : /* no output */       \
        : "m" (*(int *)CKSEG1)      \
        : "memory")
#ifdef CONFIG_CPU_CAVIUM_OCTEON
# define OCTEON_SYNCW_STR   ".set push\n.set arch=octeon\nsyncw\nsyncw\n.set pop\n"
# define __syncw()  __asm__ __volatile__(OCTEON_SYNCW_STR : : : "memory")

# define fast_wmb() __syncw()
# define fast_rmb() barrier()
# define fast_mb()  __sync()
# define fast_iob() do { } while (0)
#else /* ! CONFIG_CPU_CAVIUM_OCTEON */
# define fast_wmb() __sync()
# define fast_rmb() __sync()
# define fast_mb()  __sync()
# ifdef CONFIG_SGI_IP28
#  define fast_iob()                \
    __asm__ __volatile__(           \
        ".set   push\n\t"       \
        ".set   noreorder\n\t"      \
        "lw $0,%0\n\t"      \
        "sync\n\t"          \
        "lw $0,%0\n\t"      \
        ".set   pop"            \
        : /* no output */       \
        : "m" (*(int *)CKSEG1ADDR(0x1fa00004)) \
        : "memory")
# else
#  define fast_iob()                \
    do {                    \
        __sync();           \
        __fast_iob();           \
    } while (0)
# endif
#endif /* CONFIG_CPU_CAVIUM_OCTEON */

#ifdef CONFIG_CPU_HAS_WB

#include <asm/wbflush.h>

#define wmb()       fast_wmb()
#define rmb()       fast_rmb()
#define mb()        wbflush()
#define iob()       wbflush()

#else /* !CONFIG_CPU_HAS_WB */

#define wmb()       fast_wmb()
#define rmb()       fast_rmb()
#define mb()        fast_mb()
#define iob()       fast_iob()

#endif /* !CONFIG_CPU_HAS_WB */

#if defined(CONFIG_WEAK_ORDERING) && defined(CONFIG_SMP)
# ifdef CONFIG_CPU_CAVIUM_OCTEON
#  define smp_mb()  __sync()
#  define smp_rmb() barrier()
#  define smp_wmb() __syncw()
# else
#  define smp_mb()  __asm__ __volatile__("sync" : : :"memory")
#  define smp_rmb() __asm__ __volatile__("sync" : : :"memory")
#  define smp_wmb() __asm__ __volatile__("sync" : : :"memory")
# endif
#else
#define smp_mb()    barrier()
#define smp_rmb()   barrier()
#define smp_wmb()   barrier()
#endif

#if defined(CONFIG_WEAK_REORDERING_BEYOND_LLSC) && defined(CONFIG_SMP)
#define __WEAK_LLSC_MB      "       sync    \n"
#else
#define __WEAK_LLSC_MB      "       \n"
#endif

#define set_mb(var, value) \
    do { var = value; smp_mb(); } while (0)

#define smp_llsc_mb()   __asm__ __volatile__(__WEAK_LLSC_MB : : :"memory")

#ifdef CONFIG_CPU_CAVIUM_OCTEON
#define smp_mb__before_llsc() smp_wmb()
/* Cause previous writes to become visible on all CPUs as soon as possible */
#define nudge_writes() __asm__ __volatile__(".set push\n\t"     \
                        ".set arch=octeon\n\t"  \
                        "syncw\n\t"         \
                        ".set pop" : : : "memory")
#else
#define smp_mb__before_llsc() smp_llsc_mb()
#define nudge_writes() mb()
#endif


#define get_smp_ctrl()      __read_32bit_c0_register($12, 2)
#define set_smp_ctrl(val)   __write_32bit_c0_register($12, 2, val)
#define get_smp_status()    __read_32bit_c0_register($12, 3)
#define set_smp_status(val) __write_32bit_c0_register($12, 3, val)
#define get_smp_reim()      __read_32bit_c0_register($12, 4)
#define set_smp_reim(val)   __write_32bit_c0_register($12, 4, val)
#define get_smp_lock()      __read_32bit_c0_register($12, 5)
#define set_smp_lock(val)   __write_32bit_c0_register($12, 5, val)
#define get_smp_val()       __read_32bit_c0_register($12, 6)
#define set_smp_val(val)    __write_32bit_c0_register($12, 6, val)

#define get_smp_mbox0()     __read_32bit_c0_register($20, 0)
#define set_smp_mbox0(val)  __write_32bit_c0_register($20, 0, val)
#define get_smp_mbox1()     __read_32bit_c0_register($20, 1)
#define set_smp_mbox1(val)  __write_32bit_c0_register($20, 1, val)
#define get_smp_mbox2()     __read_32bit_c0_register($20, 2)
#define set_smp_mbox2(val)  __write_32bit_c0_register($20, 2, val)
#define get_smp_mbox3()     __read_32bit_c0_register($20, 3)
#define set_smp_mbox3(val)  __write_32bit_c0_register($20, 3, val)


#define smp_ipi_unmask(mask) do {       \
        unsigned int reim;      \
        reim = get_smp_reim();      \
        reim |= (mask) & 0xff;      \
        set_smp_reim(reim);     \
    } while(0)
#define smp_ipi_mask(mask) do {         \
        unsigned int reim;      \
        reim = get_smp_reim();      \
        reim &= ~((mask) & 0xff);   \
        set_smp_reim(reim);     \
    } while(0)

#define smp_clr_pending(mask) do {          \
        unsigned int stat;          \
        stat = get_smp_status();        \
        stat &= ~((mask) & 0xff);       \
        set_smp_status(stat);           \
    } while(0)


#endif /* !__ASSEMBLY__ */

#endif

